In [2]:
import numpy as np
import pandas as pd

In [3]:
data = {
    'name':['Tom','James','Ricky','Vin','Steve','Smith','Jack','Lee','David','Gasper','Betina','Andres'],
    'age':[25,26,25,23,30,29,23,34,40,30,51,46],
    'rating':[4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65]
}

df = pd.DataFrame(data)

In [4]:
df

      name  age  rating
0      Tom   25    4.23
1    James   26    3.24
2    Ricky   25    3.98
3      Vin   23    2.56
4    Steve   30    3.20
5    Smith   29    4.60
6     Jack   23    3.80
7      Lee   34    3.78
8    David   40    2.98
9   Gasper   30    4.80
10  Betina   51    4.10
11  Andres   46    3.65

In [5]:
df.mean()

age       31.833333
rating     3.743333
dtype: float64

In [6]:
df.median()

age       29.50
rating     3.79
dtype: float64

In [7]:
df['age'].mode()

0    23
1    25
2    30
dtype: int64

In [13]:
df['period'] = df['age'].apply(lambda x: (x // 10)*10)

In [14]:
df

      name  age  rating  period
0      Tom   25    4.23      20
1    James   26    3.24      20
2    Ricky   25    3.98      20
3      Vin   23    2.56      20
4    Steve   30    3.20      30
5    Smith   29    4.60      20
6     Jack   23    3.80      20
7      Lee   34    3.78      30
8    David   40    2.98      40
9   Gasper   30    4.80      30
10  Betina   51    4.10      50
11  Andres   46    3.65      40

In [18]:
df['period'].mode()

0    20
dtype: int64

In [25]:
tgt_cols = ['age', 'period']

print(df[tgt_cols].min())
print('-'*50)
print(df[tgt_cols].max())

age       23
period    20
dtype: int64
--------------------------------------------------
age       51
period    50
dtype: int64

In [26]:
print(df[['age', 'period']].min())
print('-'*50)
print(df[['age', 'period']].max())

age       23
period    20
dtype: int64
--------------------------------------------------
age       51
period    50
dtype: int64